var agreementText = ''+
'<h5>一、诚信规范服务承诺</h5>'+
    '作为AnyoneHelps网站的使用者，用户接受并遵守AnyoneHelps网站上公示的各项规则，以及本条例所规定的各项要求，承诺AnyoneHelps网站进行诚信规范的交易和服务。用户也同意本网站对本条例所界定的“违规行为”，予以相应的处置和处罚。<br/>'+
'<h5>二、严重违规行为</h5>'+
    '2．1　严重违规行为的界定 <br/>'+
    '严重违规行为指下面列举的任何一项行为：  <br/>'+
    '（1）线下交易 <br/>'+
    '对于在AnyoneHelps上参与的所有交易及以及得知的所有用户，均不得以任何理由诱导和实施线下交易，也不得同意和参与他人提出的线下交易。这些情况包括但不限于：  <br/>'+
    '2．2　用户应当通过真实身份信息认证注册账号，且用户提交的账号名称、头像和简介等注册信息中不得出现违法和不良信息，经AnyoneHelps(互联帮)审核，如存在上述情况，AnyoneHelps(互联帮)将不予注册；同时，在注册后，如发现用户以虚假信息骗取账号名称注册，或其账号头像、简介等注册信息存在违法和不良信息的，AnyoneHelps(互联帮)有权不经通知单方采取限期改正、暂停使用、注销登记、收回等措施。<br/>'+ '2．3　用户不应将其帐号、密码转让、出售或出借予他人使用，若用户授权他人使用帐户，应对被授权人在该帐户下发生所有行为负全部责任。<br/>'+
'<h5>三、使用规则</h5>'+
    '3．1　用户在使用AnyoneHelps(互联帮)服务时，必须遵守相关法律法规的规定，用户应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶<br/>'+
        '（1）上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：<br/>'+
        '    1） 反对宪法所确定的基本原则的；<br/>'+
        '    2） 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>'+
        '    3） 损害国家荣誉和利益的；<br/>'+
        '    4） 煽动民族仇恨、民族歧视、破坏民族团结的；<br/>'+
        '    5） 破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>'+
        '    6） 散布谣言，扰乱社会秩序，破坏社会稳定的；<br/>'+
        '    7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>'+
        '    8） 侮辱或者诽谤他人，侵害他人合法权利的；<br/>'+
        '    9） 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br/>'+
        '   10） 含有法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；<br/>'+
        '（2）不得为任何非法目的而使用网络服务系统；<br/>'+
        '（3）不利用AnyoneHelps(互联帮)服务从事以下活动：<br/>'+
        '    1) 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；<br/>'+
        '    2) 未经允许，对计算机信息网络功能进行删除、修改或者增加的；<br/>'+
        '    3) 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；<br/>'+
        '    4) 故意制作、传播计算机病毒等破坏性程序的；<br/>'+
        '    5) 其他危害计算机信息网络安全的行为。<br/>'+
    '3．2　用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿AnyoneHelps(互联帮)与合作公司、关联公司，并使之免受损害。对此，AnyoneHelps(互联帮)有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收AnyoneHelps(互联帮)帐号、追究法律责任等措施。对恶意注册AnyoneHelps(互联帮)帐号或利用AnyoneHelps(互联帮)帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，AnyoneHelps(互联帮)有权回收其帐号。同时，AnyoneHelps(互联帮)公司会视司法部门的要求，协助调查。<br/>'+
    '3．3　用户不得对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。<br/>'+
    '3．4　用户须对自己在使用AnyoneHelps(互联帮)服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在AnyoneHelps(互联帮)首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予AnyoneHelps(互联帮)等额的赔偿。<br/>'+
'<h5>四、服务内容</h5>'+
    '4．1　AnyoneHelps(互联帮)网络服务的具体内容由AnyoneHelps(互联帮)根据实际情况提供。<br/>'+
        '您同意AnyoneHelps(互联帮)得基于其自行之考虑，因任何理由，包含但不限于长时间（超过一年）未使用，或AnyoneHelps(互联帮)认为您已经违反本服务协议的文字及精神，终止您的密码、帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本服务协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，AnyoneHelps(互联帮)可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，AnyoneHelps(互联帮)对您或任何第三人均不承担任何责任。<br/>'+
'<h5>五、知识产权和其他合法权益（包括但不限于名誉权、商誉权）</h5>'+
    '5．1　用户专属权利<br/>'+
        'AnyoneHelps(互联帮)尊重他人知识产权和合法权益，呼吁用户也要同样尊重知识产权和他人合法权益。若您认为您的知识产权或其他合法权益被侵犯，请按照以下说明向AnyoneHelps(互联帮)提供资料∶<br/>'+
        '　 请注意：如果权利通知的陈述失实，权利通知提交者将承担对由此造成的全部法律责任（包括但不限于赔偿各种费用及律师费）。如果上述个人或单位不确定网络上可获取的资料是否侵犯了其知识产权和其他合法权益，AnyoneHelps(互联帮)建议该个人或单位首先咨询专业人士。<br/> '+
        '　 为了AnyoneHelps(互联帮)有效处理上述个人或单位的权利通知，请使用以下格式（包括各条款的序号）：<br/>'+
        '　　 1. 权利人对涉嫌侵权内容拥有知识产权或其他合法权益和/或依法可以行使知识产权或其他合法权益的权属证明；<br/>'+
        '　　 2. 请充分、明确地描述被侵犯了知识产权或其他合法权益的情况并请提供涉嫌侵权的第三方网址（如果有）。<br/>'+
        '　　 3. 请指明涉嫌侵权网页的哪些内容侵犯了第2项中列明的权利。<br/>'+
        '　　 4. 请提供权利人具体的联络信息，包括姓名、身份证或护照复印件（对自然人）、单位登记证明复印件（对单位）、通信地址、电话号码、传真和电子邮件。<br/>'+
        '　　 5. 请提供涉嫌侵权内容在信息网络上的位置（如指明您举报的含有侵权内容的出处，即：指网页地址或网页内的位置）以便我们与您举报的含有侵权内容的网页的所有权人/管理人联系。<br/>';